openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/eQADC.c
    Adc_ConfigureEQADCInterrupts ();

    /* Move on to INIT state. */
    adcState = ADC_INIT;
    returnValue = E_OK;
  }
  else
  {
    returnValue = E_NOT_OK;
  }

  return (returnValue);  
}

Std_ReturnType Adc_SetupResultBuffer (Adc_GroupType group, Adc_ValueGroupType *bufferPtr)
{
  Std_ReturnType returnValue = E_NOT_OK;

  /* Check for development errors. */
  if (E_OK == Adc_CheckSetupResultBuffer (group))
  {
    AdcConfigPtr->groupConfigPtr[group].status->resultBufferPtr = bufferPtr;
    
    returnValue = E_OK;
  }

  return (returnValue);
}

Adc_StreamNumSampleType Adc_GetStreamLastPointer(Adc_GroupType group, Adc_ValueGroupType** PtrToSamplePtr)
{
	Adc_StreamNumSampleType nofSample = 0;
	Adc_GroupDefType *groupPtr = (Adc_GroupDefType *)&AdcConfigPtr->groupConfigPtr[group];
	
	/** @req ADC216 */
	/* Check for development errors. */
	if ( (E_OK == Adc_CheckGetStreamLastPointer (group)) &&
		 (groupPtr->status->groupStatus != ADC_BUSY) )
	{
	    /* Set resultPtr to application buffer. */
		if(groupPtr->status->currSampleCount > 0){
			*PtrToSamplePtr = &groupPtr->status->resultBufferPtr[groupPtr->status->currSampleCount-1];
		}

	    if ((ADC_CONV_MODE_ONESHOT == groupPtr->conversionMode) &&
	        (ADC_STREAM_COMPLETED  == groupPtr->status->groupStatus))
	    {
			/** @req ADC327. */
			groupPtr->status->groupStatus = ADC_IDLE;
	    }
	    else if ((ADC_CONV_MODE_CONTINOUS == groupPtr->conversionMode) &&
	             (ADC_ACCESS_MODE_STREAMING == groupPtr->accessMode) &&
	             (ADC_STREAM_BUFFER_LINEAR == groupPtr->streamBufferMode) &&
	             (ADC_STREAM_COMPLETED    == groupPtr->status->groupStatus))
	    {
			/** @req ADC327. */
			groupPtr->status->groupStatus = ADC_IDLE;
	    }
	    else if ( (ADC_CONV_MODE_CONTINOUS == groupPtr->conversionMode) &&
	              ((ADC_STREAM_COMPLETED    == groupPtr->status->groupStatus) ||
	               (ADC_COMPLETED           == groupPtr->status->groupStatus)) )
	    {
	        /* Restart continous mode, and reset result buffer */
	        if ((ADC_CONV_MODE_CONTINOUS == groupPtr->conversionMode) &&
	            (ADC_STREAM_COMPLETED    == groupPtr->status->groupStatus))
	        {
	  		  /* Start continous conversion again */
	        	Adc_StartGroupConversion(group);
	        }
			/** @req ADC326 */
			/** @req ADC328 */
	    }
	    else{/* Keep status. */}
	}
	else
	{
		/* Some condition not met */
		*PtrToSamplePtr = NULL;
	}

	return nofSample;

}

#if (ADC_READ_GROUP_API == STD_ON)
Std_ReturnType Adc_ReadGroup (Adc_GroupType group, Adc_ValueGroupType *dataBufferPtr)
{
  Std_ReturnType returnValue = E_OK;
  uint8_t channel;
  Adc_GroupDefType *groupPtr = (Adc_GroupDefType *)&AdcConfigPtr->groupConfigPtr[group];

  if (E_OK == Adc_CheckReadGroup (group))
  {
    /* Copy the result to application buffer. */
    for (channel = 0; channel < groupPtr->numberOfChannels; channel++)
	{
		if(groupPtr->status->currSampleCount > 0){
			dataBufferPtr[channel] = (&(groupPtr->status->resultBufferPtr[groupPtr->status->currSampleCount-1]))[channel];
		}else{
			dataBufferPtr[channel] = groupPtr->status->resultBufferPtr[channel];
		}
	}

    if ((ADC_CONV_MODE_ONESHOT == groupPtr->conversionMode) &&
        (ADC_STREAM_COMPLETED  == groupPtr->status->groupStatus))
    {
		/** @req ADC330. */
		groupPtr->status->groupStatus = ADC_IDLE;
    }
    else if ((ADC_CONV_MODE_CONTINOUS == groupPtr->conversionMode) &&
             (ADC_STREAM_BUFFER_LINEAR == groupPtr->streamBufferMode) &&
             (ADC_ACCESS_MODE_STREAMING == groupPtr->accessMode) &&
             (ADC_STREAM_COMPLETED    == groupPtr->status->groupStatus))
    {
		/** @req ADC330. */
		groupPtr->status->groupStatus = ADC_IDLE;
    }
    else if ((ADC_CONV_MODE_CONTINOUS == groupPtr->conversionMode) &&
             ((ADC_STREAM_COMPLETED    == groupPtr->status->groupStatus) ||
              (ADC_COMPLETED           == groupPtr->status->groupStatus)))
    {
    	/** @req ADC329 */
      /* Restart continous mode, and reset result buffer */
      if ((ADC_CONV_MODE_CONTINOUS == groupPtr->conversionMode) &&
          (ADC_STREAM_COMPLETED    == groupPtr->status->groupStatus))
      {
		  /* Start continous conversion again */
      	Adc_StartGroupConversion(group);
      }
      /** @req ADC329 */
      /** @req ADC331 */
    }
    else{/* Keep status. */}
  }
  else
  {
    /* An error have been raised from Adc_CheckReadGroup(). */
    returnValue = E_NOT_OK;
  }

  return (returnValue);
}
#endif

Adc_StatusType Adc_GetGroupStatus (Adc_GroupType group)
{
	Adc_StatusType returnValue;

#if ( ADC_DEV_ERROR_DETECT == STD_ON )
	if( (ValidateInit(ADC_GETGROUPSTATUS_ID) == E_NOT_OK) ||
		(ValidateGroup(group, ADC_GETGROUPSTATUS_ID) == E_NOT_OK))
	{
		returnValue = ADC_IDLE;
	}
	else
	{
		returnValue = AdcConfigPtr->groupConfigPtr[group].status->groupStatus;
	}
#else
  returnValue = AdcConfigPtr->groupConfigPtr[group].status->groupStatus;
#endif
  return (returnValue);
}

void Adc_GroupConversionComplete (Adc_GroupType group)
{
	Adc_GroupDefType *adcGroup = (Adc_GroupDefType *)&AdcConfigPtr->groupConfigPtr[group];

  if(ADC_ACCESS_MODE_SINGLE == adcGroup->accessMode )
  {
	  adcGroup->status->groupStatus = ADC_STREAM_COMPLETED;
	  /* Call notification if enabled. */
	#if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
	  if (adcGroup->status->notifictionEnable && adcGroup->groupCallback != NULL)
	  {
		  adcGroup->groupCallback();
	  }
	#endif
		  /* Disable trigger. */
		  EQADC.CFCR[group].B.MODE = 0;
  }
  else
  {
	if(ADC_STREAM_BUFFER_LINEAR == adcGroup->streamBufferMode)
	{
		adcGroup->status->currSampleCount++;
		if(adcGroup->status->currSampleCount < adcGroup->streamNumSamples)
		{
		  adcGroup->status->currResultBufPtr += adcGroup->numberOfChannels;
		  adcGroup->status->groupStatus = ADC_COMPLETED;

